elmot/FoxilloScope/esp32-gateway/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32c3"
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partition_table_2mb_huge_app.csv"
CONFIG_HTTPD_WS_SUPPORT=y
CONFIG_LWIP_LOCAL_HOSTNAME="f-scope.local"
CONFIG_LWIP_MAX_SOCKETS=50

# WiFi AP defaults
CONFIG_ESP_WIFI_AP_CHANNEL=1
CONFIG_ESP_MAX_STA_CONN_AP=4
CONFIG_ESP_MAXIMUM_STA_RETRY=5

CONFIG_ESP_WIFI_AUTH_WPA2_PSK=y

# BLE / NimBLE
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=3
CONFIG_BT_NIMBLE_LL_CFG_FEAT_LE_2M_PHY=y
CONFIG_BT_CTRL_BLE_LLCP_PHY_UPDATE=y
CONFIG_BT_CTRL_BLE_LLCP_CONN_UPDATE=y
